Revit 2026 API

# RebarGeometryType Enumeration

---

Rebar geometry type

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RebarGeometryType
```
```vb
Public Enumeration RebarGeometryType
```
```cpp
public enum class RebarGeometryType
```
```fsharp
type RebarGeometryType
```

| Member name | Value | Description |
| --- | --- | --- |
| FreeForm | 1 | Free Form. |
| ShapeBased | 0 | Shape Driven. |

#### Reference

Autodesk.Revit.DB.Structure Namespace